#+TITLE: 内置函数

* *abs* (x)
  返回绝对值，参数可为整数或浮点数，如果为复数，则返回虚部。
  
  #+BEGIN_SRC python :session
    abs(1)
    abs(-1)
    abs(complex(1, 2))
    abs(100)
  #+END_SRC
  
  #+RESULTS:
  : 1
  : 1
  : 2.23606797749979
  : 100
  
* *any* (iterable)
  如果ITERABLE中任何一个元素为true则返回True，如果为空则返回False。
  
  #+BEGIN_SRC python :eval never
    def any(iterable):
        for element in iterable:
            if element:
                return True
        return False
  #+END_SRC
  
  #+BEGIN_SRC python :session
    any([1, 2, 3])
    any([0, 1, 2, 3])
    any([])
    any([0, '', (), [], False])
  #+END_SRC
  
  #+RESULTS:
  : True
  : True
  : False
  : False
  
* *ansii* (object)
  同repr()含义一样，返回OBJECT的打印时的字符串。不同的是，会转义非
  ASCII码：

  #+BEGIN_SRC python :session
    repr("我")
    ascii("我")
  #+END_SRC

  #+RESULTS:
  : "'我'"
  : "'\\u6211'"

* class *bool* ([x])
  如果x为false或省略，则返回False，否则返回True。如果x不为布尔型，下例
  所有情况都为False：

  #+BEGIN_SRC python :session
    bool()
    bool(0)
    bool('')
    bool(b'')
    bool([])
    bool({})
    bool(())
  #+END_SRC

  #+RESULTS:
  : False
  : False
  : False
  : False
  : False
  : False
  : False

* class *bytearray* ([source[,encoding[,errors]]])
  返回一个全新的byes对象，元素为取值范围为0<=x<256的mutable序列。
  bytearray是mutable版本的bytes，具有所有mutable类型序列通有的方法，
  以及绝大多数bytes具有的方法。
  
  参数传递方式为：
  
   - 如果为字符串，必须添加ENCODING参数（ERRORS参数可选）；然后使用
     str.encoding()函数将字符串转换为bytes对象。
     
	 #+BEGIN_SRC python :session
       bytearray('i have a dream!哈哈！', encoding='utf-8')
	 #+END_SRC
     
   #+RESULTS:
  : bytearray(b'i have a dream!\xe5\x93\x88\xe5\x93\x88\xef\xbc\x81')
   
   - 如果为整数，表示元素个数，且每个元素初始值为空byte。
     
	 #+BEGIN_SRC python :session
       bytearray(10)
	 #+END_SRC
     
   #+RESULTS:
  : bytearray(b'\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00')
   
   - 如果是buffer接口返回的对象，则使用buffer内容初始化。
   - 如果为iterable，其中元素须为0<=x<256的整数，用这些元素初始化。
     
	 #+BEGIN_SRC python :session
       bytearray([1, 2, 3, 3])
       bytearray([255])
       bytearray([256])
	 #+END_SRC
     
   #+RESULTS:
  : bytearray(b'\x01\x02\x03\x03')
  : bytearray(b'\xff')
  : Traceback (most recent call last): 
  :   File "<stdin>", line 1, in <module>
  : ValueError: byte must be in range(0, 256)
   
* *chr* (i)
  返回Unicode值为i的字符（以字符串表示）。相反的函数为ord(i)。i的取值
  范围为(0 - 1,114,111)。

  #+BEGIN_SRC python :session
    chr(97)
    ord('a')
    chr(8364)
    chr(1114111)
    chr(1114112)
  #+END_SRC

  #+RESULTS:
  : 'a'
  : 97
  : '€'
  : '\U0010ffff'
  : Traceback (most recent call last):
  :   File "<stdin>", line 1, in <module>
  : ValueError: chr() arg not in range(0x110000)

* *divmode* (a,b)
  接受2个数值（非复数），返回除值和余数组成的tuple。如果都为都为整数结
  果与(a // b, a % b)相同；如果有浮点数，结果为(q, a % b)，其中值通常
  为math.floor(a / b)，也有可能会小1，任何情况下，q * b + a % b的结果
  都非常难接近a。

  #+BEGIN_SRC python :session
    10 // 3, 10 % 3
    divmod(10, 3)
    divmod(10.4, 3)
  #+END_SRC

  #+RESULTS:
  : (3, 1)
  : (3, 1)
  : (3.0, 1.4000000000000004)

* *enumerate* (iterable, start=0)
  返回enumerate对象。参数ITERABLE必须为sequence，或iterator，或其他支
  持迭代的对象。enumerate返回对象的__next__()方法返回tuple，第一个元素
  为索引（默认从0开始），第二个元素为原来对象的元素。
  
  #+BEGIN_SRC python
    sessons = ['Spring', 'Summer', 'Fall', 'Wintwer']
    print(list(enumerate(sessons)))
    print(list(enumerate(sessons, start=10)))
    e = iter(enumerate(sessons, start=100))
    for i in range(6):
        print(next(e, 'nothing'))
  #+END_SRC
  
  #+RESULTS:
  : [(0, 'Spring'), (1, 'Summer'), (2, 'Fall'), (3, 'Wintwer')]
  : [(10, 'Spring'), (11, 'Summer'), (12, 'Fall'), (13, 'Wintwer')]
  : (100, 'Spring')
  : (101, 'Summer')
  : (102, 'Fall')
  : (103, 'Wintwer')
  : nothing
  : nothing
  
  其实现相当于：
  
  #+BEGIN_SRC python
    def enumarate(sequence, start=0):
        n = start
        for elem in sequence:
            yield n, elem
            n += 1
  #+END_SRC

* class *float* ([x])
  返回X表示的浮点数，X可为数值或字符串。如果无参数，则返回0.0。
  
  如果X为字符串，前后可有空格，前面可带正负号，但必须是有效的数值组成
  的字符串。此外，还可使用'nan'和'inf'(或'infinity')表示非数值和无限数，
  且可不区分大小写。
  
  #+BEGIN_SRC python :session
    float()
    float(1)
    float('+1.23')
    float('   -12345\n')
    float('1e-003')
    float('-infinity')
    float('12三')
  #+END_SRC
  
  #+RESULTS:
  : 0.0
  : 1.0
  : 1.23
  : -12345.0
  : 0.001
  : -inf
  : Traceback (most recent call last): 
  :   File "<stdin>", line 1, in <module>
  : ValueError: could not convert string to float: '12三'
  
* *format* (value[,format_spec])
  按照FORMAT_SPEC将VALUE格式转换为字符串。如果FORMAT_SPEC为空字符串，
  则相当于str(value)：

  #+BEGIN_SRC python :session
    format('me', '<30')
    format('me', '>30')
    format('me', '30')
    format('me', '')
  #+END_SRC

  #+RESULTS:
  : 'me                            '
  : '                            me'
  : 'me                            '
  : 'me'

  调用format(value, format_spec)时，实际上是转换为了
  type(value).__format__(value, format_spec)。即搜索value对应类型
  的__format__()方法。如果递归搜索父类有__format__()方法，且无
  format_spec参数，则使用该方法；如果有使用了format_spec参数，则返回
  TypeError错误。如果format_spec或方法返回值不是字符串，也会返回
  TypeError错误。

* *help* ([object])
  在命令行查看帮助文档。如果不带参数，则进入帮助文档交互模式。如果为字
  符串，则显示对应的module、函数、类、方法、关键字或相关文档。如果参数
  为对象，则显示对应文档，如help(1)显示整型对应的帮助文档。

  #+BEGIN_SRC python :session
     help('None')
  #+END_SRC

  #+RESULTS:
  #+begin_example python
  Help on NoneType object:

  class NoneType(object)
   |  Methods defined here:
   |
   |  __bool__(self, /)
   |      self != 0
   |
   |  __new__(*args, **kwargs) from builtins.type
   |      Create and return a new object.  See help(type) for accurate signature.
   |
   |  __repr__(self, /)
   |      Return repr(self).
  #+end_example

* *hash* (object)
  返回object的Hash值（如果有）。Hash值通常用在字典（dict）查找时快速比
  较key值。数值相同的数，即使类型不同，也具有相同的返回结果（如1和1.0）。
  
  object只能为immutable类型。
  
  #+BEGIN_SRC python :session
    hash(1)
    hash(1.0)
    hash('a')
    hash(b'a')
    hash(('a'))
    hash(('a', 'b'))
    hash(['a'])
  #+END_SRC
  
  #+RESULTS:
  : 1
  : 1
  : 244014917210466474
  : 244014917210466474
  : 244014917210466474
  : 8532064262518639778
  : Traceback (most recent call last): 
  :   File "<stdin>", line 1, in <module>
  : TypeError: unhashable type: 'list'
  
* *hex* (x)
  将整数转换为小写的16进制字符串。

  #+BEGIN_SRC python :session
    hex(255)
    hex(-24)
    hex('12')
  #+END_SRC

  #+RESULTS:
  : '0xff'
  : '-0x18'
  : Traceback (most recent call last):
  :   File "<stdin>", line 1, in <module>
  : TypeError: 'str' object cannot be interpreted as an integer

  如需使用16进制字符串表示浮点数，使用float.hex()方法。

  #+BEGIN_SRC python :session
    float.hex(1.2)
    hex(1.2)
  #+END_SRC

  #+RESULTS:
  : '0x1.3333333333333p+0'
  : Traceback (most recent call last):
  :   File "<stdin>", line 1, in <module>
  : TypeError: 'float' object cannot be interpreted as an integer

* *id* (object)
  返回表示该对象“身份”的整数。此整数在对象的整个生命周期内都独一无二。
  如果两个对象的生命周期没有交集，可能相同。

  *CPython实现中：*  此值为该对象的内存地址。

  #+BEGIN_SRC python :session
    id(1)
    id(1)
    id(2)
    hex(id('me'))
    a = 1
    id(a)
  #+END_SRC

  #+RESULTS:
  : 93851494420096
  : 93851494420096
  : 93851494420128
  : '0x7f84d841e110'
  : >>> 93851494420096

* class *int* (x, base=10)
  返回x（可为数字和字符串）表示的数字。如果没有参数，返回0；如果x为数
  字，返回x.__int__()；如果为浮点数，返回值为去除小数点后面的内容。

  如果x不是数字或有base参数，x须为字符串、bytes或bytearray实例。前面可
  有正负号，首位可有空格。base的取值范围内为2-36，默认为10。

  #+BEGIN_SRC python :session
    int()                           # 没有参数
    int(10)
    int(1.2)

    int('10', base=2)
    int(b'ff', base=16)
    int('10', base=10)

    int('10', base=37)
  #+END_SRC

  #+RESULTS:
  : 0
  : 10
  : 1
  : >>> 2
  : 255
  : 10
  : >>> Traceback (most recent call last):
  :   File "<stdin>", line 1, in <module>
  : ValueError: int() base must be >= 2 and <= 36

* *issubclass* (class, classinfo)
  如果class直接或间接为classinfo的子类，返回True。一个类总是自己的子类。
  classinfo可为单个类名，也可为多个类型名组成的tuple。为tuple时，其中
  的每个类名都会检查。其他任何情况都会返回TypeError错误。

  #+BEGIN_SRC python :session
    issubclass(int, int)
    issubclass(int, (float, int))
    issubclass(int, float)
  #+END_SRC

  #+RESULTS:
  : True
  : True
  : False

* *iter* (object[,sentinel])
  返回一个iterator对象。第二个参数决定第一个参数的解释方式：
  
  - 如果无第二个参数：object须为一个支持迭代协议（__iter__()方法）的
    collection对象；或者须支持sequence协议（__getitem__()，整数参数以0
    开始）。如果两种协议都不支持，则返回TypeError错误。
    
    #+BEGIN_SRC python :session
      i = iter((1, 2, 3))
      print(i)
      print(list(i))
    #+END_SRC
    
    #+RESULTS:
    :
    : <tuple_iterator object at 0x7f99da84fb00>
    : [1, 2, 3]
    
  - 如果有第二个参数sentinel：object须为可调用对象（即函数）。所返回的
    iterator的生成过程为不带参数调用object的__next__()方法。如果返回值
    等于sentinel则返回StopIteration错误，否则返回__next__()方法的返回
    值。
    
	第二种形式适合于读取文本，直到指定行。如下例直到readline()方法返回
    空字符串：

	#+BEGIN_SRC python :eval never
      with open('files/emma.txt') as fp:
          for line in iter(fp.readline, ''):
              print(line)
	#+END_SRC

  #+RESULTS:
  #+begin_example
  Help on built-in function pow in module builtins:

  pow(x, y, z=None, /)

     Equivalent to x**y (with two arguments) or x**y % z (with three arguments)

     Some types, such as ints, are able to use a more efficient algorithm when

     invoked using the three argument form.

  #+end_example

* *len* (s)
  返回对象s中的元素个数。s可为sequence（如string、bytes、tuple、list或
  range），也可为collection（如dictionary、set或frozen set）。
  
  #+BEGIN_SRC python :session
    from array import array

    len('abc')
    len(b'abc')
    len(bytearray(b'abc'))
    len((1, 2, 3))
    len([1, 2, 3])
    len(range(3))
    len({'a': 1, 'b': 2, 'c': 3})
    len({1, 2, 3})
    len(memoryview(b'abc'))
    len(array('i', [1, 2, 3]))
    len(iter([1, 2, 3]))
  #+END_SRC

  #+RESULTS:
  #+begin_example

  >>> 3
  3
  3
  3
  3
  3
  3
  3
  3
  3
  Traceback (most recent call last):
    File "<stdin>", line 1, in <module>
  TypeError: object of type 'list_iterator' has no len()
  #+end_example

* class *list* ([iterable])
  list实际上是一个mutable sequence类型。
  
  #+BEGIN_SRC python :session
    from array import array

    list(1, 2, 3)
    list([1, 2, 3])
    list((1, 2, 3))
    list({1, 2, 3})
    list({'a': 1, 'b': 2, 'c': 3})
    list(array('i', [1, 2, 3]))
    list(bytes(b'123'))
    list(bytearray(b'123'))
    list(memoryview(b'123'))
    list(range(3))
    list(iter([1, 2, 3]))
  #+END_SRC
  
  #+RESULTS:
  #+begin_example
  
  >>> Traceback (most recent call last):
    File "<stdin>", line 1, in <module>
  TypeError: list() takes at most 1 argument (3 given)
  [1, 2, 3]
  [1, 2, 3]
  [1, 2, 3]
  ['c', 'a', 'b']
  [1, 2, 3]
  [49, 50, 51]
  [49, 50, 51]
  [49, 50, 51]
  [0, 1, 2]
  [1, 2, 3]
  #+end_example
  
* *oct* (x)
  返回数字x的8进制字符串。如果x不为int对象，则需有__index__()方法，且
  返回一个整数。

  #+BEGIN_SRC python :session
     oct(10)

     class Foo:
         def __index__(self):
             return 100

     f = Foo()
     oct(f)

     oct(10.0)
  #+END_SRC

  #+RESULTS:
  : '0o12'
  : >>> ... ... ... >>> >>> '0o144'
  : >>> Traceback (most recent call last):
  :   File "<stdin>", line 1, in <module>
  : TypeError: 'float' object cannot be interpreted as an integer

* *ord* (c)
  接受单个Unicode字符组成的字符串，返回对应的Unicode值。比如ord('a')
  返回97。对应的函数为chr()。

  #+BEGIN_SRC python :session
     ord('a')
     chr(97)
  #+END_SRC

  #+RESULTS:
  : 97
  : 'a'

* *pow* (x,y[,z])
  返回x的y次方，相当于x**y；如果有第三个参数z，则相当于pow(x, y) % z，
  不过效率更高。

  #+BEGIN_SRC python :session
     10 ** 2
     pow(10, 2)
     pow(10, 2, 3)
  #+END_SRC

  #+RESULTS:
  : 100
  : 100
  : 1

* *print* (*object,sep='',end='\n',file=sys.stdout,flush=False)
  将objects打印到文本流file中，以sep隔开，最后输出end。如果无参数，则
  只打印end。

  #+BEGIN_SRC python :session
    print(1, 2, 3, sep='|', end='$\n')
    print(1, 2, sep='\t')
  #+END_SRC

  #+RESULTS:
  : 1|2|3$
  : 1	2

  所有非关键字参数都先转换为字符串，如str()函数。

  file参数须为有write(string)方法的对象；如果无此方法，或为None，则使
  用sys.stdout对象。由于所有需打印的参数都先转换为字符串，所以不能用
  于二进制模式的文件对象，此情况使用file.write(...)替换。

  输出内容是否被buffer由file参数决定，如果flush参数为true，则强制
  flush。？？
* *repr* (object)
  返回打印前用字符串表示的object。

  对大多数对象而言，此函数返回的值与使用eval()函数返回的值相同，否则
  用尖括号表示其类型名及其名称和地址。

  在声明类时，可定义__repr__()方法指定此函数的返回值。

  #+BEGIN_SRC python :session
    repr("'123'")
    repr("123")

    class Foo:
        def __init__(self, name):
            self.name = name
        def __repr__(self):
            return self.name

    f = Foo('claudio')
    repr(f)
    f1 = Foo("'claudio'")
    repr(f1)
  #+END_SRC

  #+RESULTS:
  : '"\'123\'"'
  : "'123'"
  : >>> >>> ... ... ... ... ... >>> >>> >>> 'claudio'
  : >>> "'claudio'"

* *sum* (iterable[,start])
  将START与ITERABLE中的每个元素从左到右相加，返回总和。ITERABLE中的元
  素通常为数字，START的值不允许为字符串。
  
  #+BEGIN_SRC python :session
    sum([1, 2, 3])
    sum([1, 2, 3], 100)
  #+END_SRC
  
  #+RESULTS:
  : 6
  : 106
  
  对于非数值计算，下面几个函数对特定情况效率更高：
  
   - ''.join(sequence)：拼接字符串。
     
   #+BEGIN_SRC python :session
     l = ['a', 'b', 'c']
     '|'.join(l)
   #+END_SRC
   
   #+RESULTS:
   :
   : 'a|b|c'
   
   - math.fsum()：求浮点数和，且保留精度。
     
   #+BEGIN_SRC python :session
     floats = [10 / 3, 10 / 7, 10 / 9]
     sum(floats)

     import math
     math.fsum(floats)
   #+END_SRC
   
   #+RESULTS:
   :
   : 5.8730158730158735
   : >>> >>> 5.8730158730158735
   
   - itertools.chain()：拼接多个iterable。
     
